Repository: Wujuhu/Codexio
Catalog: macos/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# 正在恢复模型服务配置并停止代理…
source: Restoring provider configuration and stopping the relay…
zh_hans: 正在恢复模型服务配置并停止代理…

# 正在扫描本机日志
source: Scanning local logs
zh_hans: 正在扫描本机日志

# 正在抓取数据
source: Fetching data
zh_hans: 正在抓取数据

# 正在检查新版…
source: Checking for updates…
zh_hans: 正在检查新版…

# 正在检查更新
source: Checking for updates
zh_hans: 正在检查更新

# 正在汇总用量数据
source: Summarizing usage data
zh_hans: 正在汇总用量数据

# 正在确认账户模式
source: Checking account mode
zh_hans: 正在确认账户模式

# 正在读取
source: Loading
zh_hans: 正在读取

# 正在读取会员额度
source: Reading plan allowance
zh_hans: 正在读取会员额度

# 正在读取本机记录
source: Loading local records
zh_hans: 正在读取本机记录

# 正在连接 Codex
source: Connecting to Codex
zh_hans: 正在连接 Codex

# 正在重启 Codex 客户端…
source: Restarting Codex…
zh_hans: 正在重启 Codex 客户端…

# 正常
source: OK
zh_hans: 正常

# 此账户不提供 ChatGPT 额度
source: ChatGPT limits are not available for this account
zh_hans: 此账户不提供 ChatGPT 额度

# 此账户没有这项数据的访问权限
source: This account cannot access these details
zh_hans: 此账户没有这项数据的访问权限

# 每周
source: Weekly
zh_hans: 每周

# 每天
source: Daily
zh_hans: 每天

# 每小时
source: Hourly
zh_hans: 每小时

# 每日
source: Daily
zh_hans: 每日

# 每日 Token · 近一年
source: Daily tokens · Last year
zh_hans: 每日 Token · 近一年

# 每日 Token 活动；方向键选择日期，回车查看日志
source: Daily token activity; use arrow keys to choose a date and Enter to view logs
zh_hans: 每日 Token 活动；方向键选择日期，回车查看日志

# 水球
source: Water orb
zh_hans: 水球

# 没有匹配的模型
source: No matching models
zh_hans: 没有匹配的模型

# 没有可用重置次数
source: No resets available
zh_hans: 没有可用重置次数

# 活动
source: Activity
zh_hans: 活动

# 活动洞察
source: Activity insights
zh_hans: 活动洞察

# 浅色
source: Light
zh_hans: 浅色

# 深色
source: Dark
zh_hans: 深色

# 源码和预览模式不安装更新
source: Source and preview modes do not install updates
zh_hans: 源码和预览模式不安装更新

# 点击左侧请求 在这里查看详情
source: Select a request to view details
zh_hans: 点击左侧请求 在这里查看详情

# 点击方格查看当天日志
source: Select a day to view its logs
zh_hans: 点击方格查看当天日志

# 版本号必须为三段数字，例如 0.1.2
source: Use a three-part version such as 0.1.2
zh_hans: 版本号必须为三段数字，例如 0.1.2

# 版本号超出 Windows 支持的范围
source: Version exceeds the range supported by Windows
zh_hans: 版本号超出 Windows 支持的范围

# 状态
source: Status
zh_hans: 状态

# 现在重启
source: Restart now
zh_hans: 现在重启

# 用户
source: User
zh_hans: 用户

# 用户请求
source: User requests
zh_hans: 用户请求

# 用户请求 / 发起时间
source: User request / start time
zh_hans: 用户请求 / 发起时间

# 用户请求数
source: User requests
zh_hans: 用户请求数

# 用户请求详情
source: User request details
zh_hans: 用户请求详情

# 用户：
source: User:
zh_hans: 用户：

# 用量
source: Usage
zh_hans: 用量

# 用量待补齐
source: Usage incomplete
zh_hans: 用量待补齐

# 用量操作失败: %s
source: Usage operation failed: %s
zh_hans: 用量操作失败: %s

# 用量数据加载失败
source: Could not load usage data
zh_hans: 用量数据加载失败

# 用量数据已加载
source: Usage data loaded
zh_hans: 用量数据已加载

# 用量服务启动失败（%s），请检查运行日志
source: Usage service could not start (%s). Check the app log.
zh_hans: 用量服务启动失败（%s），请检查运行日志

# 用量服务启动失败，请检查运行日志
source: Usage service could not start. Check the app log.
zh_hans: 用量服务启动失败，请检查运行日志

# 用量统计服务异常
source: Usage service error
zh_hans: 用量统计服务异常

# 用量趋势
source: Usage trend
zh_hans: 用量趋势

# 确定
source: OK
zh_hans: 确定

# 确认应用
source: Apply selection
zh_hans: 确认应用

# 磁贴
source: Tiles
zh_hans: 磁贴

# 稍后自行重启
source: Reopen later
zh_hans: 稍后自行重启

# 窗口
source: Window
zh_hans: 窗口

# 立即刷新
source: Refresh now
zh_hans: 立即刷新

# 立即同步
source: Sync now
zh_hans: 立即同步

# 第三方供应商 %s 按同名 OpenAI 模型价格估算，可能与第三方账单不同
source: Provider %s is estimated using the equivalent OpenAI model price; the actual bill may differ
zh_hans: 第三方供应商 %s 按同名 OpenAI 模型价格估算，可能与第三方账单不同

# 等待可见回复
source: Waiting for a visible reply
zh_hans: 等待可见回复

# 等待同一周期内足够的额度与本机消费记录
source: Waiting for enough allowance and local usage records within one period
zh_hans: 等待同一周期内足够的额度与本机消费记录

# 等待同一账号与套餐下足够的额度变化和已计价调用。
source: Waiting for enough allowance changes and priced calls for the same account and plan.
zh_hans: 等待同一账号与套餐下足够的额度变化和已计价调用。

# 等待完整的用量与额度数据。
source: Waiting for complete usage and allowance data.
zh_hans: 等待完整的用量与额度数据。

# 等待日志同步完整后重新计算。
source: Waiting for log synchronization before recalculating.
zh_hans: 等待日志同步完整后重新计算。

# 等待日数据
source: Waiting for daily data
zh_hans: 等待日数据

# 等待更新
source: Waiting
zh_hans: 等待更新

# 等待模型调用
source: Waiting for a model call
zh_hans: 等待模型调用

# 等待用量记录
source: Waiting for usage records
zh_hans: 等待用量记录

# 等待补账
source: Waiting for metering
zh_hans: 等待补账

# 等待请求内容
source: Waiting for a request
zh_hans: 等待请求内容

# 等待足够的用量记录与额度变化。
source: Waiting for enough usage records and allowance changes.
zh_hans: 等待足够的用量记录与额度变化。

# 等待重置次数与明细。
source: Waiting for reset count and details.
zh_hans: 等待重置次数与明细。

# 等待额度数据
source: Waiting for allowance data
zh_hans: 等待额度数据

# 粘贴
source: Paste
zh_hans: 粘贴

# 紧凑
source: Compact
zh_hans: 紧凑

# 累计
source: Cumulative
zh_hans: 累计

# 累计 Token 数
source: Lifetime tokens
zh_hans: 累计 Token 数

# 累计观测不能证明单次请求上下文与模型归属，仅供消费参考
source: Cumulative observations do not identify individual calls or context; for reference only
zh_hans: 累计观测不能证明单次请求上下文与模型归属，仅供消费参考

# 约
source: Approx.
zh_hans: 约

# 约 %d 分钟后重置
source: Resets in about %d minutes
zh_hans: 约 %d 分钟后重置

# 约 %d 天后重置
source: Resets in about %d days
zh_hans: 约 %d 天后重置

# 约 %d 小时后重置
source: Resets in about %d hours
zh_hans: 约 %d 小时后重置

# 组成这轮请求的调用 · 双击查看明细
source: Calls in this request · Double-click for details
zh_hans: 组成这轮请求的调用 · 双击查看明细

# 经典
source: Classic
zh_hans: 经典

# 结束时间
source: Ended at
zh_hans: 结束时间

# 结果尚未确认，可重试本次操作
source: The result is not confirmed. Retry this operation.
zh_hans: 结果尚未确认，可重试本次操作

# 统计截至
source: Usage as of
zh_hans: 统计截至

# 继续采样
source: Continue sampling
zh_hans: 继续采样

# 续费日期
source: Renewal date
zh_hans: 续费日期

# 续费日期请使用 YYYY-MM-DD。
source: Use YYYY-MM-DD for the renewal date.
zh_hans: 续费日期请使用 YYYY-MM-DD。

# 续费日期（YYYY-MM-DD）
source: Renewal date (YYYY-MM-DD)
zh_hans: 续费日期（YYYY-MM-DD）

# 缓存写入
source: Cache write
zh_hans: 缓存写入

# 缓存创建
source: Cache write
zh_hans: 缓存创建

# 缓存利用
source: Cache use
zh_hans: 缓存利用

# 缓存命中
source: Cache hit
zh_hans: 缓存命中

# 缓存命中率
source: Cache hit rate
zh_hans: 缓存命中率

# 缓存命中率 = 缓存读取 Token ÷ 输入 Token（含缓存）；不把缓存创建计为命中。
source: Cache hit rate = cached input ÷ total input tokens. Cache writes are not counted as hits.
zh_hans: 缓存命中率 = 缓存读取 Token ÷ 输入 Token（含缓存）；不把缓存创建计为命中。

# 缓存属于输入、推理属于输出；分项不会重复计费。
source: Cached tokens are part of input; reasoning is part of output. Components are not charged twice.
zh_hans: 缓存属于输入、推理属于输出；分项不会重复计费。

# 缓存读取
source: Cached input
zh_hans: 缓存读取

# 缓存输入
source: Cached input
zh_hans: 缓存输入

# 编辑
source: Edit
zh_hans: 编辑

# 编辑 Standard 基础价 · 美元 / 1M Token
source: Edit Standard base prices · USD / 1M tokens
zh_hans: 编辑 Standard 基础价 · 美元 / 1M Token

# 编辑基础价
source: Edit base price
zh_hans: 编辑基础价

# 编辑标准 API 基础价 · 美元 / 百万 Token
source: Edit Standard API base prices · USD / 1M tokens
zh_hans: 编辑标准 API 基础价 · 美元 / 百万 Token

# 编辑资料
source: Edit profile
zh_hans: 编辑资料

# 缺少完整的请求起止时间，无法确认总耗时。
source: Complete request start and end times are missing; total duration is unknown.
zh_hans: 缺少完整的请求起止时间，无法确认总耗时。

# 缺少已使用 Token 类别的明确价格
source: Prices for some token categories are unavailable
zh_hans: 缺少已使用 Token 类别的明确价格

# 缺少该模型与服务档位的 Codex 换算规则
source: No Codex pricing rule for this model and service tier
zh_hans: 缺少该模型与服务档位的 Codex 换算规则

# 缺少输入或输出 Token 分项
source: Input or output tokens are missing
zh_hans: 缺少输入或输出 Token 分项

# 缺少这段记录的订阅套餐信息。
source: Subscription plan information is missing for these records.
zh_hans: 缺少这段记录的订阅套餐信息。

# 网络异常，无法读取额度
source: Network error; cannot read allowance
zh_hans: 网络异常，无法读取额度

# 网络请求超时
source: Network request timed out
zh_hans: 网络请求超时

# 美元 / 1M Token
source: USD / 1M tokens
zh_hans: 美元 / 1M Token

# 耗时
source: Duration
zh_hans: 耗时

# 聊天
source: Chat
zh_hans: 聊天

# 聊天排行
source: Top chats
zh_hans: 聊天排行

# 聊天用量排行
source: Chat usage ranking
zh_hans: 聊天用量排行

# 背景透明
source: Transparent background
zh_hans: 背景透明

# 自动
source: Automatic
zh_hans: 自动

# 自动下载更新
source: Download updates automatically
zh_hans: 自动下载更新

# 自动发现 Codex
source: Detect Codex automatically
zh_hans: 自动发现 Codex

# 自动发现 Codex / ChatGPT.app
source: Detect Codex / ChatGPT.app automatically
zh_hans: 自动发现 Codex / ChatGPT.app

# 自动同步价格
source: Sync prices automatically
zh_hans: 自动同步价格

# 自动更新已关闭
source: Automatic updates are off
zh_hans: 自动更新已关闭

# 自动更新已开启
source: Automatic updates are on
zh_hans: 自动更新已开启

# 自动（按订阅）
source: Automatic (by plan)
zh_hans: 自动（按订阅）

# 自选日期
source: Custom
zh_hans: 自选日期

# 至
source: To
zh_hans: 至

# 菜单栏
source: Menu bar
zh_hans: 菜单栏

# 菜单栏内容
source: Menu bar content
zh_hans: 菜单栏内容

# 计价状态
source: Pricing status
zh_hans: 计价状态

# 计价说明
source: Pricing details
zh_hans: 计价说明

# 计划名称
source: Plan name
zh_hans: 计划名称

# 计量分项异常
source: Inconsistent metering components
zh_hans: 计量分项异常

# 计量时间
source: Metered at
zh_hans: 计量时间

# 订阅
source: Subscription
zh_hans: 订阅

# 订阅价格
source: Subscription price
zh_hans: 订阅价格

# 订阅价格（USD）
source: Subscription price (USD)
zh_hans: 订阅价格（USD）

# 订阅价格（美元）
source: Subscription price (USD)
zh_hans: 订阅价格（美元）

# 订阅资料
source: Subscription profile
zh_hans: 订阅资料

# 订阅额度
source: Subscription allowance
zh_hans: 订阅额度

# 记录质量
source: Record quality
zh_hans: 记录质量

# 设置
source: Settings
zh_hans: 设置

# 设置…
source: Settings…
zh_hans: 设置…

# 该内置服务不支持 Responses 转发
source: This built-in provider does not support a Responses relay
zh_hans: 该内置服务不支持 Responses 转发

# 该模型尚无价格
source: This model has no listed price
zh_hans: 该模型尚无价格

# 该模型尚无可精确匹配的 OpenAI 参考价格
source: No matching OpenAI reference price for this model
zh_hans: 该模型尚无可精确匹配的 OpenAI 参考价格

# 详情
source: Details
zh_hans: 详情

# 说明
source: Details
zh_hans: 说明

# 请从完整的 Codexio.app 启动
source: Launch the complete Codexio.app bundle
zh_hans: 请从完整的 Codexio.app 启动

# 请先完成 Codex 登录或配置供应商认证，再开启上游检测
source: Sign in to Codex or configure provider authentication before enabling upstream detection
zh_hans: 请先完成 Codex 登录或配置供应商认证，再开启上游检测

# 请先确认上一次重置的结果
source: Confirm the previous reset result first
zh_hans: 请先确认上一次重置的结果

# 请在设置中确认这段历史记录所属的账号。
source: Confirm the account associated with these historical records in Settings.
zh_hans: 请在设置中确认这段历史记录所属的账号。

# 请填写普通输入和输出的基础价。
source: Enter base prices for uncached input and output.
zh_hans: 请填写普通输入和输出的基础价。

# 请填写有效的金额和日期
source: Enter a valid amount and date
zh_hans: 请填写有效的金额和日期

# 请填写模型 ID。
source: Enter a model ID.
zh_hans: 请填写模型 ID。

# 请增加每次请求的 Token 和等价美元详情，在 Session ID 旁边加上感叹号。鼠标悬停时显示会话标题和用户输入的两行预览，长内容在第二行末尾省略。
source: Show tokens and estimated dollars for each request, with a details control beside the session ID. Hover to preview the chat title and user message, truncating long text.
zh_hans: 请增加每次请求的 Token 和等价美元详情，在 Session ID 旁边加上感叹号。鼠标悬停时显示会话标题和用户输入的两行预览，长内容在第二行末尾省略。

# 请求
source: Requests
zh_hans: 请求

# 请求 / 时间
source: Request / time
zh_hans: 请求 / 时间

# 请求数
source: Requests
zh_hans: 请求数

# 请求数 {:,}
source: Requests {:,}
zh_hans: 请求数 {:,}

# 请求日志
source: Request logs
zh_hans: 请求日志

# 请求记录加载失败
source: Could not load request records
zh_hans: 请求记录加载失败

# 请求详情
source: Request details
zh_hans: 请求详情

# 请求详情，移开鼠标或按 Escape 关闭
source: Request details; move the pointer away or press Escape to close
zh_hans: 请求详情，移开鼠标或按 Escape 关闭

# 请求频繁，请稍后刷新
source: Too many requests. Refresh later.
zh_hans: 请求频繁，请稍后刷新

# 请输入有效的美元金额。
source: Enter a valid USD amount.
zh_hans: 请输入有效的美元金额。

# 请输入有限的非负单价
source: Enter finite, nonnegative prices
zh_hans: 请输入有限的非负单价

# 请重新登录 Codex
source: Sign in to Codex again
zh_hans: 请重新登录 Codex

# 读取失败
source: Could not load
zh_hans: 读取失败

# 读取失败: %s
source: Could not load: %s
zh_hans: 读取失败: %s

# 读取超时
source: Read timed out
zh_hans: 读取超时

# 调整导航顺序
source: Reorder navigation
zh_hans: 调整导航顺序

# 调整显示顺序
source: Reorder display
zh_hans: 调整显示顺序

# 调用
source: Call
zh_hans: 调用

# 调用 ID
source: Call ID
zh_hans: 调用 ID

# 调用组成 · %s
source: Call breakdown · %s
zh_hans: 调用组成 · %s

# 调用耗时
source: Call duration
zh_hans: 调用耗时

# 账户已变更，请重新刷新
source: The account changed. Refresh again.
zh_hans: 账户已变更，请重新刷新

# 账户已变更，请重新选择
source: The account changed. Select the reset again.
zh_hans: 账户已变更，请重新选择

# 账户已变更，请重新选择重置
source: The account changed. Select the reset again.
zh_hans: 账户已变更，请重新选择重置

# 账户或统计数据已变化，请重新刷新
source: The account or statistics changed. Refresh again.
zh_hans: 账户或统计数据已变化，请重新刷新

# 贴边停靠
source: Edge docking
zh_hans: 贴边停靠

# 费用
source: Cost
zh_hans: 费用

# 费用 ·
source: Cost ·
zh_hans: 费用 ·

# 费用估算
source: Estimated cost
zh_hans: 费用估算

# 费用未定价
source: Cost is unpriced
zh_hans: 费用未定价

# 起始日期应早于或等于结束日期。
source: The start date must be on or before the end date.
zh_hans: 起始日期应早于或等于结束日期。

# 超时
source: Timed out
zh_hans: 超时

# 超高
source: Ultra
zh_hans: 超高

# 趋势
source: Trend
zh_hans: 趋势

# 跟随系统
source: Follow system
zh_hans: 跟随系统

# 路由已被其他程序修改，保留当前配置和转发
source: Another app changed the route; the current configuration and relay are retained
zh_hans: 路由已被其他程序修改，保留当前配置和转发

# 路由恢复记录校验失败
source: Route recovery information could not be verified
zh_hans: 路由恢复记录校验失败

# 路由未生效，正在恢复
source: The route was not applied; restoring it
zh_hans: 路由未生效，正在恢复

# 路由配置已更新。可以等待当前任务结束后自行重启；现在重启会先请求客户端正常退出。
source: The route configuration is updated. You can reopen after the current task finishes. Restart now requests a normal quit first.
zh_hans: 路由配置已更新。可以等待当前任务结束后自行重启；现在重启会先请求客户端正常退出。

# 转发服务中断
source: Relay interrupted
zh_hans: 转发服务中断

# 轻度
source: Low
zh_hans: 轻度

# 较前 30 天
source: vs. previous 30 days
zh_hans: 较前 30 天

# 较前 7 天
source: vs. previous 7 days
zh_hans: 较前 7 天

# 较昨天
source: vs. yesterday
zh_hans: 较昨天

# 较高可信
source: Higher confidence
zh_hans: 较高可信

# 输入
source: Input
zh_hans: 输入

# 输入 + 输出
source: Input + output
zh_hans: 输入 + 输出

# 输入 Token
source: Input tokens
zh_hans: 输入 Token

# 输入 Token（含缓存）
source: Input tokens (including cache)
zh_hans: 输入 Token（含缓存）

# 输入 Token：{:,} 缓存命中：{:,} 缓存创建：{:,}
source: Input tokens: {:,} Cache hits: {:,} Cache writes: {:,}
zh_hans: 输入 Token：{:,} 缓存命中：{:,} 缓存创建：{:,}

# 输入与输出基础价必须填写，已填写单价必须为有限非负数
source: Input and output base prices are required. Prices must be finite and nonnegative.
zh_hans: 输入与输出基础价必须填写，已填写单价必须为有限非负数

# 输入和输出基础价必须为非负数
source: Input and output base prices must be nonnegative
zh_hans: 输入和输出基础价必须为非负数

# 输入预览
source: Prompt preview
zh_hans: 输入预览

# 输入（含缓存）
source: Input (including cache)
zh_hans: 输入（含缓存）

# 输出
source: Output
zh_hans: 输出

# 输出 Token
source: Output tokens
zh_hans: 输出 Token

# 边框颜色
source: Border color
zh_hans: 边框颜色

# 边框颜色无效，请使用 #RRGGBB。
source: Invalid border color. Use #RRGGBB.
zh_hans: 边框颜色无效，请使用 #RRGGBB。

# 运行中
source: Running
zh_hans: 运行中

# 近 30 天
source: Last 30 days
zh_hans: 近 30 天

# 近 7 天
source: Last 7 days
zh_hans: 近 7 天

# 近一年暂无活动记录
source: No activity recorded in the last year
zh_hans: 近一年暂无活动记录

# 返回应用
source: Return to app
zh_hans: 返回应用

# 这会消耗当前账户中所选的重置，无法撤销。
source: This consumes the selected reset for the current account and cannot be undone.
zh_hans: 这会消耗当前账户中所选的重置，无法撤销。

# 这会消耗所选重置，无法撤销。
source: This consumes the selected reset and cannot be undone.
zh_hans: 这会消耗所选重置，无法撤销。

# 这次重置已不可用
source: This reset is no longer available
zh_hans: 这次重置已不可用

# 进行中
source: In progress
zh_hans: 进行中

# 进行中：从主请求发起时间累计，包含工具等待；并行子代理不重复相加。
source: In progress: elapsed since the main request began, including tool waits; parallel subagents are not added twice.
zh_hans: 进行中：从主请求发起时间累计，包含工具等待；并行子代理不重复相加。

# 连接失败
source: Connection failed
zh_hans: 连接失败

# 连接已关闭
source: Connection closed
zh_hans: 连接已关闭

# 退出
source: Quit
zh_hans: 退出

# 退出 Codexio
source: Quit Codexio
zh_hans: 退出 Codexio

# 退出并更新
source: Quit and update
zh_hans: 退出并更新

# 退出时自动重启失败：%s
source: Automatic restart on exit failed: %s
zh_hans: 退出时自动重启失败：%s

# 退出程序
source: Quit
zh_hans: 退出程序

# 适配新版 Codex 客户端
source: Support the updated Codex client
zh_hans: 适配新版 Codex 客户端

# 选择
source: Choose
zh_hans: 选择

# 选择额度样式、窗口和外观
source: Choose the style, window and appearance
zh_hans: 选择额度样式、窗口和外观

# 透明度
source: Opacity
zh_hans: 透明度

# 逐次重置明细暂不可用
source: Individual reset details are unavailable
zh_hans: 逐次重置明细暂不可用

# 速度
source: Speed
zh_hans: 速度

# 速度未知
source: Unknown speed
zh_hans: 速度未知

# 速度未知 %d 次
source: Unknown speed in %d calls
zh_hans: 速度未知 %d 次

# 部分数据
source: Partial data
zh_hans: 部分数据

# 部分未定价
source: Partially unpriced
zh_hans: 部分未定价

# 部分本机模型列表暂不可读取；保留最近有效列表
source: Some local model lists are unavailable; retaining the last valid list
zh_hans: 部分本机模型列表暂不可读取；保留最近有效列表

# 部分来源读取失败
source: Some local records could not be read
zh_hans: 部分来源读取失败

# 部分请求尚无可用价格。
source: Prices are unavailable for some requests.
zh_hans: 部分请求尚无可用价格。

# 部分请求还无法对应到周额度。
source: Some requests cannot yet be attributed to weekly allowance.
zh_hans: 部分请求还无法对应到周额度。

# 部分调用使用参考单价，金额供参考。
source: Some calls use reference prices; the amount is an estimate.
zh_hans: 部分调用使用参考单价，金额供参考。

# 配置字段路径为空
source: Configuration field path is empty
zh_hans: 配置字段路径为空

# 配置已更新；重新打开 Codex 后生效
source: Configuration updated; reopen Codex to apply it
zh_hans: 配置已更新；重新打开 Codex 后生效

# 配置被更高优先级覆盖，路由未生效
source: A higher-priority configuration overrides this route
zh_hans: 配置被更高优先级覆盖，路由未生效

# 采样时间未记录
source: Sample time not recorded
zh_hans: 采样时间未记录

# 采样时间段
source: Sample interval
zh_hans: 采样时间段

# 重启 Codex 客户端后应用改动。现在重启会中断正在进行的请求。
source: Restart Codex to apply the changes. Restarting now interrupts active requests.
zh_hans: 重启 Codex 客户端后应用改动。现在重启会中断正在进行的请求。

# 重新打开 Codex 以应用路由？
source: Reopen Codex to apply the route?
zh_hans: 重新打开 Codex 以应用路由？

# 重新扫描
source: Rescan
zh_hans: 重新扫描

# 重新扫描本地记录
source: Rescan local records
zh_hans: 重新扫描本地记录

# 重置
source: Resets
zh_hans: 重置

# 重置 %d
source: Reset %d
zh_hans: 重置 %d

# 重置 %s
source: Resets %s
zh_hans: 重置 %s

# 重置 1
source: Reset 1
zh_hans: 重置 1

# 重置 2
source: Reset 2
zh_hans: 重置 2

# 重置 N/A
source: Reset N/A
zh_hans: 重置 N/A

# 重置已提交，正在同步额度
source: Reset submitted. Refreshing limits.
zh_hans: 重置已提交，正在同步额度

# 重置时间
source: Resets in
zh_hans: 重置时间

# 重置时间 —
source: Resets at —
zh_hans: 重置时间 —

# 重置次数
source: Resets
zh_hans: 重置次数

# 重置结果尚未确认，可重试本次操作
source: The reset result is unconfirmed. Retry the same operation.
zh_hans: 重置结果尚未确认，可重试本次操作

# 重试本次
source: Retry this reset
zh_hans: 重试本次

# 附件消息
source: Attachment message
zh_hans: 附件消息

# 隐藏 Codexio
source: Hide Codexio
zh_hans: 隐藏 Codexio

# 需要本机 Codex 的 ChatGPT 登录状态
source: A local Codex ChatGPT sign-in is required
zh_hans: 需要本机 Codex 的 ChatGPT 登录状态

# 页面和统计已完成。
source: Pages and statistics are ready.
zh_hans: 页面和统计已完成。

# 顶层模式
source: Always on top
zh_hans: 顶层模式

# 顶部
source: Top
zh_hans: 顶部

# 预估费用
source: Estimated cost
zh_hans: 预估费用

# 预览模式不修改 Codex 配置
source: Preview mode does not change Codex configuration
zh_hans: 预览模式不修改 Codex 配置

# 预览模式不启用上游检测
source: Preview mode does not enable upstream detection
zh_hans: 预览模式不启用上游检测

# 额度
source: Allowance
zh_hans: 额度

# 额度估算
source: Allowance estimate
zh_hans: 额度估算

# 额度估算间隔
source: Estimate interval
zh_hans: 额度估算间隔

# 额度刷新
source: Limit refresh
zh_hans: 额度刷新

# 额度变化达到 2 个百分点后开始计算。
source: Calculation starts after a change of 2 percentage points.
zh_hans: 额度变化达到 2 个百分点后开始计算。

# 额度小组件 · 三种样式
source: Allowance widgets · three styles
zh_hans: 额度小组件 · 三种样式

# 额度样式
source: Allowance style
zh_hans: 额度样式

# 额度池待确认
source: Allowance pool unconfirmed
zh_hans: 额度池待确认

# 额度窗口
source: Allowance window
zh_hans: 额度窗口

# 额度类型待确认
source: Allowance type unconfirmed
zh_hans: 额度类型待确认

# 额度范围
source: Allowance scope
zh_hans: 额度范围

# 额度读取失败，未继续使用重置
source: Could not read allowance; the reset was not continued
zh_hans: 额度读取失败，未继续使用重置

# 额度读取循环异常
source: Allowance read loop failed
zh_hans: 额度读取循环异常

# 额度重置
source: Rate-limit reset
zh_hans: 额度重置

# 首次成功读取额度后记录
source: Recorded after the first successful allowance read
zh_hans: 首次成功读取额度后记录

# 高度
source: High
zh_hans: 高度

# ，即将退出
source: ; quitting shortly
zh_hans: ，即将退出

# ；也可用左右方向键调整
source: ; Left and Right arrow keys also adjust it
zh_hans: ；也可用左右方向键调整

# ；缓存创建使用单列价格，缺失时保留未定价
source: ; cache writes use their listed price; unavailable prices remain unpriced
zh_hans: ；缓存创建使用单列价格，缺失时保留未定价

# ；输入/缓存读取 ×%g，输出 ×%g；缓存创建按普通输入价，无写入附加费
source: ; input/cached input ×%g, output ×%g; cache writes use input pricing with no write surcharge
zh_hans: ；输入/缓存读取 ×%g，输出 ×%g；缓存创建按普通输入价，无写入附加费
